Значение арифметического выражения $6^{260}+6^{160}+6^{60}-x$, где $x$ — целое положительное число, не превышающее $2030$, записали в $6$-ричной системе счисления. Определите наименьшее значение $x$, при котором количество нулей в $6$-ричной записи числа, являющегося значением данного арифметического выражения, равно $202$. В ответе запишите это число в десятичной системе счисления.

```python
for s in range(1, 2031):
    x = 6**260 + 6*160 + 6**60 - s
    count = 0
    while x > 0:
        if x % 6 == 0:
            count += 1
        x = x // 6
    if count == 202:
        print(s)
        break
```
